"""
© Skuratov's Team, 2024

Задача: сравнить нагрузку на пальцы на двух раскладках:
йцукен и diktor с использованием 2-х файлов: voina-i-mir и 1grams-3.
"""

from text_analyzer import TextAnalyzer
from visualization import *
from time import monotonic


def main():
    filename = (r'C:\sortchbukw.csv', )
    labels = ('йцукен', 'diktor', 'zubachew', 'skoropis')
    symbols_with_shift = (('!', '"', '№', ';', '%', ':', '?',
                           '*', '(', ')', '_', '+', '/', ','),
                          ('№', '%', ':', ';', '-', '"', '(',
                           ')', '+', 'ъ', '?', '!', '_'),
                          ('!', '"', '№', ';', '%', ':', '?',
                           '*', '(', ')', '_', '+', '/'),
                          ('', ))
    homerows = (('ф', 'ы', 'в', 'а', 'о', 'л', 'д', 'ж', ' '),
                ('у', 'и', 'е', 'о', 'н', 'т', 'с', 'р', ' '),
                ('г', 'и', 'е', 'о', 'т', 'с', 'н', 'з', ' '),
                ('у', 'и', 'е', 'о', 'н', 'т', 'с', 'р', ' '),
                (' ', ))
    keylout_dd = {'rfi1б': [(' ', ),
                            (' ', ),
                            (' ', ),
                            (' ', )],
                  'rfi5м': [('+', '_', ')', '-', '=', 'з', 'х',
                             'ъ', 'ж', 'э'),
                            ('+', '_', ')', '0', '*', '=', 'ч',
                             'ш', 'щ', 'р', 'й', 'ж'),
                            ('0', ')', '-', '_', '=', '+', 'х',
                             'ц', 'щ', '/', 'з', 'ж', 'ч'),
                            (')', '_', '"',
                             'ч', 'ш', 'щ', 'р', 'й', 'ж')],
                  'rfi4б': [('(', '0', 'щ', 'д', 'ю', '.'),
                            ('(', '9', 'д', 'с', 'г'),
                            ('9', '(', 'п', 'н', 'к'),
                            ('(', 'д', 'с', 'г')],
                  'rfi3с': [('*', '8', '9', 'ш', 'л', 'б'),
                            ('"', '8', 'к', 'т', 'п'),
                            ('8', '*', 'р', 'с', 'в'),
                            ('к', 'т', 'п')],
                  'rfi2у': [('6', '?', '7', 'н', 'г', 'р', 'о',
                             'т', 'ь'),
                            ('6', '-', ';', '7', 'з', 'в', 'л',
                             'н', 'м', 'б'),
                            ('7', '?', '6', ':', 'й', 'л', 'б',
                             'м', 'т', 'д'),
                            ('-', 'з', 'в', 'л', 'н', 'б', 'м')],
                  'lfi2у': [('4', '%', '5', 'к', 'е', 'а', 'п',
                             'м', 'и'),
                            ('4', '5', '.', ',', '!', '?', 'а',
                             'ы', 'ю', 'о'),
                            ('5', '4', '%', ';', ',', '.', 'я',
                             'о', 'у', 'э'),
                            ('?', '!', ',', '.', 'о', 'а',
                             'ы', 'ю')],
                  'lfi3с': [('№', '3', 'у', 'в', 'с'),
                            ('3', '№', 'я', 'е', 'х'),
                            ('3', '№', 'а', 'е', 'ю'),
                            ('ъ', 'я', 'е', 'х')],
                  'lfi4б': [('"', '2', 'ц', 'ы', 'ч'),
                            ('2', 'ь', 'ъ', 'и', 'э'),
                            ('2', '"', 'ы', 'и', 'ь', 'ъ'),
                            ('ё', 'ь', 'и', 'э')],
                  'lfi5м': [('!', 'ё', 'й', 'ф', 'я', '1'),
                            ('ё', '1', 'ц', 'у', 'ф'),
                            ('ё', '1', '!', 'ф', 'г', 'ш'),
                            ('*', '.', 'ц', 'у', 'ф')]}

    symbol_counter = TextAnalyzer(filename, keylout_dd,
                                  symbols_with_shift, homerows)
    final_loads = symbol_counter.count_symbols()
    loads_for_ccombol = final_loads[2]
    loads_for_combol = final_loads[3]
    loads_for_ccombor = final_loads[0]
    loads_for_combor = final_loads[1]
    draw_histogram_fines(final_loads)
    print(f"{'':<20} {'Правая':<30} {'Левая':<30}")
    print(
        f"{'Одной рукой':<20} {' '.join(f'{loads_for_ccombor[i]}' for i in range(4)):<30} \
{' '.join(f'{loads_for_ccombol[i]}' for i in range(4)):<30}")
    print(
        f"{'Удобная':<20} {' '.join(f'{loads_for_combor[i]}' for i in range(4)):<30} \
{' '.join(f'{loads_for_combol[i]}' for i in range(4)):<30}")


if __name__ == "__main__":
    main()
